#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
google_project_service.services["artifactregistry.googleapis.com"]: Refreshing state... [id=baynext-x1307/artifactregistry.googleapis.com]
google_service_account.cloud_run_backend_sa: Refreshing state... [id=projects/baynext-x1307/serviceAccounts/baynext-backend-sa@baynext-x1307.iam.gserviceaccount.com]
google_project_service.services["run.googleapis.com"]: Refreshing state... [id=baynext-x1307/run.googleapis.com]
google_service_account.cloud_run_job_sa: Refreshing state... [id=projects/baynext-x1307/serviceAccounts/baynext-ml-job-sa@baynext-x1307.iam.gserviceaccount.com]
google_project_service.services["iam.googleapis.com"]: Refreshing state... [id=baynext-x1307/iam.googleapis.com]
google_project_service.services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=baynext-x1307/cloudresourcemanager.googleapis.com]
google_project_iam_member.cloud_run_backend_sa_artifact_registry_reader: Refreshing state... [id=baynext-x1307/roles/artifactregistry.reader/serviceAccount:baynext-backend-sa@baynext-x1307.iam.gserviceaccount.com]
google_project_iam_member.cloud_run_backend_sa_run_invoker: Refreshing state... [id=baynext-x1307/roles/run.servicesInvoker/serviceAccount:baynext-backend-sa@baynext-x1307.iam.gserviceaccount.com]
google_project_iam_member.cloud_run_job_sa_artifact_registry_reader: Refreshing state... [id=baynext-x1307/roles/artifactregistry.reader/serviceAccount:baynext-ml-job-sa@baynext-x1307.iam.gserviceaccount.com]
google_project_iam_member.cloud_run_job_sa_run_invoker: Refreshing state... [id=baynext-x1307/roles/run.jobsExecutorWithOverrides/serviceAccount:baynext-ml-job-sa@baynext-x1307.iam.gserviceaccount.com]
google_cloud_run_v2_job.baynext_ml_job: Refreshing state... [id=projects/baynext-x1307/locations/europe-west1/jobs/baynext-ml-job]
google_artifact_registry_repository.docker_repo: Refreshing state... [id=projects/baynext-x1307/locations/europe-west1/repositories/baynext-docker-repo]
data.google_artifact_registry_docker_image.backend_image: Reading...
data.google_artifact_registry_docker_image.backend_image: Read complete after 1s [id=https://artifactregistry.googleapis.com/v1/projects/baynext-x1307/locations/europe-west1/repositories/baynext-docker-repo/dockerImages/baynext-backend:latest]
google_cloud_run_v2_service.baynext_backend_service: Refreshing state... [id=projects/baynext-x1307/locations/europe-west1/services/baynext-backend-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_v2_service.baynext_backend_service is tainted, so must be replaced
-/+ resource "google_cloud_run_v2_service" "baynext_backend_service" {
      - annotations             = {} -> null
      - client                  = "gcloud" -> null
      - client_version          = "530.0.0" -> null
      ~ conditions              = [
          - {
              - execution_reason     = ""
              - last_transition_time = "2025-07-17T12:18:37.580502Z"
              - message              = <<-EOT
                    Revision 'baynext-backend-service-00003-j5t' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=80 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=baynext-x1307&resource=cloud_run_revision/service_name/baynext-backend-service/revision_name/baynext-backend-service-00003-j5t&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22baynext-backend-service%22%0Aresource.labels.revision_name%3D%22baynext-backend-service-00003-j5t%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - reason               = ""
              - revision_reason      = "HEALTH_CHECK_CONTAINER_ERROR"
              - severity             = ""
              - state                = "CONDITION_FAILED"
              - type                 = "RoutesReady"
            },
          - {
              - execution_reason     = ""
              - last_transition_time = "2025-07-17T12:18:37.545935Z"
              - message              = <<-EOT
                    The user-provided container failed to start and listen on the port defined provided by the PORT=80 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=baynext-x1307&resource=cloud_run_revision/service_name/baynext-backend-service/revision_name/baynext-backend-service-00003-j5t&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22baynext-backend-service%22%0Aresource.labels.revision_name%3D%22baynext-backend-service-00003-j5t%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - reason               = ""
              - revision_reason      = ""
              - severity             = ""
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "ConfigurationsReady"
            },
        ] -> (known after apply)
      ~ create_time             = "2025-07-17T09:12:17.338034Z" -> (known after apply)
      ~ creator                 = "github-deployer@baynext-x1307.iam.gserviceaccount.com" -> (known after apply)
      - custom_audiences        = [] -> null
      + delete_time             = (known after apply)
      ~ effective_annotations   = {} -> (known after apply)
      ~ effective_labels        = {
          - "commit-sha"                 = "68b3e3407fd7f2aeeed9e8a827349e88fcb025c4" -> null
          - "managed-by"                 = "github-actions" -> null
            # (1 unchanged element hidden)
        }
      ~ etag                    = "\"CInU48MGEMiUm30/cHJvamVjdHMvYmF5bmV4dC14MTMwNy9sb2NhdGlvbnMvZXVyb3BlLXdlc3QxL3NlcnZpY2VzL2JheW5leHQtYmFja2VuZC1zZXJ2aWNl\"" -> (known after apply)
      + expire_time             = (known after apply)
      ~ generation              = "3" -> (known after apply)
      ~ id                      = "projects/baynext-x1307/locations/europe-west1/services/baynext-backend-service" -> (known after apply)
      ~ ingress                 = "INGRESS_TRAFFIC_ALL" -> (known after apply)
      - invoker_iam_disabled    = false -> null
      - labels                  = {} -> null
      ~ last_modifier           = "github-deployer@baynext-x1307.iam.gserviceaccount.com" -> (known after apply)
      ~ latest_created_revision = "projects/baynext-x1307/locations/europe-west1/services/baynext-backend-service/revisions/baynext-backend-service-00003-j5t" -> (known after apply)
      + latest_ready_revision   = (known after apply)
      ~ launch_stage            = "GA" -> (known after apply)
        name                    = "baynext-backend-service"
      ~ observed_generation     = "3" -> (known after apply)
      ~ reconciling             = false -> (known after apply)
      ~ terminal_condition      = [
          - {
              - execution_reason     = ""
              - last_transition_time = "2025-07-17T12:18:37.580502Z"
              - message              = <<-EOT
                    Revision 'baynext-backend-service-00003-j5t' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=80 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=baynext-x1307&resource=cloud_run_revision/service_name/baynext-backend-service/revision_name/baynext-backend-service-00003-j5t&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22baynext-backend-service%22%0Aresource.labels.revision_name%3D%22baynext-backend-service-00003-j5t%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - reason               = ""
              - revision_reason      = "HEALTH_CHECK_CONTAINER_ERROR"
              - severity             = ""
              - state                = "CONDITION_FAILED"
              - type                 = "Ready"
            },
        ] -> (known after apply)
      ~ traffic_statuses        = [] -> (known after apply)
      ~ uid                     = "a27f7d88-952c-4ce4-a6a5-976c1cc9917b" -> (known after apply)
      ~ update_time             = "2025-07-17T12:18:17.262589Z" -> (known after apply)
      + uri                     = (known after apply)
      ~ urls                    = [
          - "https://baynext-backend-service-1098927466988.europe-west1.run.app",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ template {
          - annotations                      = {} -> null
          - gpu_zonal_redundancy_disabled    = false -> null
          - labels                           = {
              - "commit-sha"                 = "68b3e3407fd7f2aeeed9e8a827349e88fcb025c4"
              - "goog-terraform-provisioned" = "true"
              - "managed-by"                 = "github-actions"
            } -> null
          ~ max_instance_request_concurrency = 80 -> (known after apply)
          - session_affinity                 = false -> null
          ~ timeout                          = "300s" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ containers {
              - args       = [] -> null
              ~ build_info = [] -> (known after apply)
              - command    = [] -> null
              - depends_on = [] -> null
              ~ image      = "europe-west1-docker.pkg.dev/baynext-x1307/baynext-docker-repo/baynext-backend:latest" -> "europe-west1-docker.pkg.dev/baynext-x1307/baynext-docker-repo/baynext-backend@sha256:f591d247ebb8d1580da3f6444406779c2de1e489137be43b28d89511e3f1df0b"

              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }

              ~ ports {
                  ~ name           = "http1" -> (known after apply)
                    # (1 unchanged attribute hidden)
                }

              - resources {
                  - cpu_idle          = true -> null
                  - limits            = {
                      - "cpu"    = "1000m"
                      - "memory" = "512Mi"
                    } -> null
                  - startup_cpu_boost = false -> null
                }

              - startup_probe {
                  - failure_threshold     = 1 -> null
                  - initial_delay_seconds = 0 -> null
                  - period_seconds        = 240 -> null
                  - timeout_seconds       = 240 -> null

                  - tcp_socket {
                      - port = 80 -> null
                    }
                }
            }

          - scaling {
              - max_instance_count = 20 -> null
              - min_instance_count = 0 -> null
            }
        }

      - traffic {
          - percent = 100 -> null
          - type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST" -> null
        }
    }

  # neon_project.baynext_project will be created
  + resource "neon_project" "baynext_project" {
      + compute_provisioner       = (known after apply)
      + connection_uri            = (sensitive value)
      + connection_uri_pooler     = (sensitive value)
      + database_host             = (known after apply)
      + database_host_pooler      = (known after apply)
      + database_name             = (known after apply)
      + database_password         = (sensitive value)
      + database_user             = (known after apply)
      + default_branch_id         = (known after apply)
      + default_endpoint_id       = (known after apply)
      + history_retention_seconds = 86400
      + id                        = (known after apply)
      + name                      = "baynext"
      + pg_version                = 17
      + region_id                 = "aws-eu-central-1"
      + store_password            = "yes"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @lgrosjean, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*